from creatures import Hero
import random


class InventorySystem:
    def init(self):
        self.backpack_items = {
            "зелье силы": "hero_potion_strength",
            "зелье лечения": "hero_potion_heal",
            "свиток искр" : "hero_scroll_of_sparks",
            "зелье регенерации здоровья" : "hero_potion_of_regen_hp"
        }

    # (1) Функция отображения рюкзака
    def show_backpack(self, hero):

        backpack_phrases = [f"--- Содержимое мешка путника ---",
    "(🎒) То, что несёшь с собой:",  
    "📜 Инвентарь по контракту:",  
    "🖤 Что осталось при тебе:",  
    "(🎒) Мешок героя :",  
    "(🔮) Ричард шепчет: «Посмотри, что у тебя есть...»",  
    "⚔️ Твой дорожный арсенал:",  
    "📦 Сокровища и ресурсы:",
     ]

        empty_backpack_phrases = ["Мешок пуст — даже тени не осталось."  
    "Ничего. Только пыль и обрывки надежды."  
    "(🎒) Ричард вздыхает: «Ты всё потратил...»"  
    "Пустота — твой единственный спутник."  
    "Внутри — лишь эхо твоих решений."  
    "Нечем лечиться. Нечем бить. Остался только ты."  
    "Сокровища исчезли. Даже крысы ушли."  
    "Ты — твоё единственное оружие."  
    "Магический мешок молчит... пуст."  
    "Ресурсы кончились. Действуй осторожно."
     ]
        items = {
            "Зелье силы": hero.hero_potion_strength,
            "Зелье лечения": hero.hero_potion_heal,
            "Свиток искр" : hero.hero_scroll_of_sparks,
            "Зелье регенерации здоровья" : hero.hero_potion_of_regen_hp
        }
        menu_items = [random.choice(backpack_phrases)]

        for name, count in items.items():
            if count > 0:
                menu_items.append(f"{name}: {count}")
        if len(menu_items) == 1:
            menu_items.append(random.choice(empty_backpack_phrases))
        return "\n".join(menu_items)

    # (2) Функция использования зелий
    def use_item(self, hero, hero_choice):
        result = ""

        if hero_choice == "1":
            if hero.hero_potion_strength > 0:
                hero.count_crit_attack += 1
                hero.hero_potion_strength -= 1
                result = "(🗡️)  \u001b[36;1mВы выпили зелье силы.\u001b[0m"
            else:
                result = "Нет зелья силы!"

        elif hero_choice == "2":
            if hero.hero_potion_heal > 0:
                hero.hero_health = min(hero.hero_health + 5, hero.hero_max_health)
                hero.hero_potion_heal -= 1
                result = "(❤️‍🩹)  \u001b[32;1mВы выпили зелье лечения.\u001b[0m"
            else:
                result = "Нет зелья лечения!"

        elif hero_choice == "3":
            if hero.hero_scroll_of_sparks > 0:
                hero.bullet_of_sparks += 1
                result = "(📜)  \u001b[33;1mПрочитав свиток на вашем ружье появились раскаленные красные символы.\u001b[0m"
            else:
                result = "Нет свитков искр!"

        elif hero_choice == "4":
            if hero.hero_potion_of_regen_hp > 0:
                hero.process_regen()
                hero.hero_potion_of_regen_hp -= 1
                result = "(💊)  \u001b[35;1m Активирована регенерация здоровья.\u001b[0m"
            else:
                result = "Нет зелья регенерации!"

        elif hero_choice == "0":
            result = "Вы закрыли рюкзак"

        else:
            result = "Нет такого предмета"

        return result


    # (3) Функция меню рюкзака
    def get_backpack_menu(self):
            return """(0) Закрыть рюкзак
    (1) Зелье силы - Увеличивает следующую атаку в 2 раза
    (2) Зелье лечения - Восстанавливает 5 здоровья
    (3) Свиток искр - Позволяет стрелять дробью
    (4) Зелье регенерации - Восстанавливает здоровье со временем""".strip()


    # (4) Функция для вызова в main инвентаря одной строкой - open_backpack(hero)
    def open_backpack(self, hero):
        print(f"_")  # Начало формата СДЕЛАТЬ ДРУГОЙ ПОСЛЕ ОПРЕДЕЛЕНИЯ В ФАЙЛЕ format_system
        hero_choice = ""
        while hero_choice != "0":
            try:
                # Показываем содержимое рюкзака
                print(self.show_backpack(hero))
                # Показываем меню выбора
                print(self.get_backpack_menu())

                hero_choice = input("Выберите предмет: ").lower()

                if hero_choice == "0":
                    print("Рюкзак закрыт.")
                    break
                else:
                    # Используем выбранный предмет
                    result = self.use_item(hero, hero_choice)
                    print(result)

            except Exception as e:
                print(f"Ошибка при использовании предмета: {e}")
                return False

        print(f"_")  # Конец формата # Конец формата СДЕЛАТЬ ДРУГОЙ ПОСЛЕ ОПРЕДЕЛЕНИЯ В ФАЙЛЕ format_system
        return True
